app/controllers/posts_controller.rb

INSERT INTO "posts" ("titulo", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titulo", "Teste"], ["descricao", "teste"], ["created_at", "2018-09-10 20:02:36.661134"], ["updated_at", "2018-09-10 20:02:36.661134"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "titulo" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["titulo", "Lula Preso em Curitiba"], ["updated_at", "2018-09-14 16:59:53.883863"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)